AchimPieters/esp32-homekit-Sunshade/main/main.c
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(POS_UPDATE_INTERVAL_MS));

        motion_dir_t dir = s_motion;

        if (dir != last_dir) {
            pos_f    = (float)s_cur_pos;
            last_dir = dir;
        }

        if (dir == MOTION_STOPPED) {
            relays_all_off();
            homekit_notify_position();
            break;
        }

        int tgt = s_tgt_pos;

        if (dir == MOTION_OPENING) {
            pos_f += delta;
            if (pos_f >= (float)tgt) {
                s_cur_pos = tgt;
                s_motion  = MOTION_STOPPED;
                relays_all_off();
                homekit_notify_position();
                ESP_LOGI(TAG, "Reached %d%% (open)", tgt);
                break;
            }
        } else {
            pos_f -= delta;
            if (pos_f <= (float)tgt) {
                s_cur_pos = tgt;
                s_motion  = MOTION_STOPPED;
                relays_all_off();
                homekit_notify_position();
                ESP_LOGI(TAG, "Reached %d%% (close)", tgt);
                break;
            }
        }

        if (pos_f < 0.0f) {
            pos_f = 0.0f;
        } else if (pos_f > 100.0f) {
            pos_f = 100.0f;
        }

        int new_pos = clamp_position((int)pos_f);
        s_cur_pos = new_pos;
        if (new_pos != last_notified) {
            last_notified = new_pos;
            homekit_notify_position();
        }
    }

    // Dual-core: critical section ensures the other core sees NULL immediately.
    taskENTER_CRITICAL(&s_task_mux);
    s_move_task = NULL;
    taskEXIT_CRITICAL(&s_task_mux);

    vTaskDelete(NULL);
}

static void movement_task_start(void) {
    // Two-phase flag prevents dual-core TOCTOU: both cores seeing NULL simultaneously
    // and each spawning a duplicate movement task.
    bool create = false;

    taskENTER_CRITICAL(&s_task_mux);
    if (s_move_task == NULL && !s_task_creating) {
        s_task_creating = true;
        create = true;
    }
    taskEXIT_CRITICAL(&s_task_mux);

    if (!create) {
        return;
    }

    if (xTaskCreate(movement_task, "sunshade_move", 4096, NULL, 5,
                    (TaskHandle_t *)&s_move_task) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create movement task");
        relays_all_off();
        s_motion = MOTION_STOPPED;
        homekit_notify_position();
    }

    taskENTER_CRITICAL(&s_task_mux);
    s_task_creating = false;
    taskEXIT_CRITICAL(&s_task_mux);
}

// ── Sunshade control ──────────────────────────────────────────────────────────
static bool is_locked(void) {
    if (s_cal_state != CAL_IDLE) {
        ESP_LOGW(TAG, "Command ignored: calibration in progress");
        return true;
    }

    if (s_is_homing) {
        ESP_LOGW(TAG, "Command ignored: homing in progress");
        return true;
    }

    return false;
}

static void sunshade_open(void) {
    if (is_locked()) {
        return;
    }

    if (s_cur_pos >= 100) {
        ESP_LOGI(TAG, "Already fully open");
        return;
    }

    ESP_LOGI(TAG, "Opening: %d%% -> 100%%", s_cur_pos);

    relays_all_off();
    s_tgt_pos           = 100;
    s_motion            = MOTION_OPENING;
    target_pos_ch.value = HOMEKIT_UINT8(100);

    relay_activate_open();
    homekit_notify_position();
    nvs_save_last_position(100);
    movement_task_start();
}

static void sunshade_close(void) {
    if (is_locked()) {
        return;
    }

    if (s_cur_pos <= 0) {
        ESP_LOGI(TAG, "Already fully closed");
        return;
    }

    ESP_LOGI(TAG, "Closing: %d%% -> 0%%", s_cur_pos);

    relays_all_off();
    s_tgt_pos           = 0;
    s_motion            = MOTION_CLOSING;
    target_pos_ch.value = HOMEKIT_UINT8(0);

    relay_activate_close();
    homekit_notify_position();
    nvs_save_last_position(0);
    movement_task_start();
}

static void sunshade_stop(void) {
    if (s_cal_state == CAL_OPENING) {
        calibration_confirm_open();
        return;
    }

    if (is_locked()) {
        return;
    }

    ESP_LOGI(TAG, "Stop at %d%%", s_cur_pos);

    s_motion            = MOTION_STOPPED;
    s_tgt_pos           = s_cur_pos;
    target_pos_ch.value = HOMEKIT_UINT8((uint8_t)s_cur_pos);

    relays_all_off();
    homekit_notify_position();
    nvs_save_last_position((uint8_t)s_cur_pos);
}

static void sunshade_move_to(int target) {
    if (is_locked()) {
        return;
    }

    if (target < 0) {
        target = 0;
    } else if (target > 100) {
        target = 100;
    }

    if (target == s_cur_pos) {
        sunshade_stop();
        return;
    }

    relays_all_off();

    s_tgt_pos           = target;
    target_pos_ch.value = HOMEKIT_UINT8((uint8_t)target);

    if (target > s_cur_pos) {
        ESP_LOGI(TAG, "Move to %d%% (opening)", target);
        s_motion = MOTION_OPENING;
        relay_activate_open();
    } else {
        ESP_LOGI(TAG, "Move to %d%% (closing)", target);
        s_motion = MOTION_CLOSING;
        relay_activate_close();
    }

    homekit_notify_position();
    nvs_save_last_position((uint8_t)target);
    movement_task_start();
}

// ── HomeKit setters ───────────────────────────────────────────────────────────
static void target_position_setter(homekit_value_t value) {
    if (value.format != homekit_format_uint8) {
        ESP_LOGE(TAG, "target_position: unexpected format %d", value.format);
        return;
    }

    ESP_LOGI(TAG, "HomeKit -> target_position: %d%%", value.uint8_value);
    sunshade_move_to((int)value.uint8_value);
}

static void hold_position_setter(homekit_value_t value) {
    if (value.format != homekit_format_bool) {
        ESP_LOGE(TAG, "hold_position: unexpected format %d", value.format);
        return;
    }

    if (value.bool_value) {
        ESP_LOGI(TAG, "HomeKit -> hold_position: stop");
        sunshade_stop();
    }
}

// ── Calibration ───────────────────────────────────────────────────────────────
static void calibration_led_task(void *arg) {
    while (s_cal_state != CAL_IDLE) {
        uint32_t half = (s_cal_state == CAL_CLOSING) ? 100 : 400;

