AchimPieters/esp32-homekit-Sunshade/main/main.c
        led_write(true);
        vTaskDelay(pdMS_TO_TICKS(half));
        led_write(false);
        vTaskDelay(pdMS_TO_TICKS(half));
    }

    if (s_cal_success) {
        // 5 short flashes = success
        for (int i = 0; i < 5; i++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(60));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(60));
        }
    } else {
        // 3 long flashes = failed / aborted / timeout
        for (int i = 0; i < 3; i++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(400));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(200));
        }
    }

    vTaskDelete(NULL);
}

static void calibration_confirm_open(void) {
    uint32_t elapsed = now_ms() - s_cal_t0_ms;

    relays_all_off();

    if (elapsed < 2000) {
        ESP_LOGW(TAG_CAL, "Aborted: STOP pressed too soon (%lu ms)",
                 (unsigned long)elapsed);
        s_cal_success        = false;
        s_cal_state          = CAL_IDLE;
        s_cur_pos            = 0;
        s_tgt_pos            = 0;
        s_motion             = MOTION_STOPPED;
        current_pos_ch.value = HOMEKIT_UINT8(0);
        target_pos_ch.value  = HOMEKIT_UINT8(0);
        homekit_notify_position();
        return;
    }

    s_cal_ms             = elapsed;
    s_cal_done           = true;
    s_cal_success        = true;
    s_cur_pos            = 100;
    s_tgt_pos            = 100;
    s_motion             = MOTION_STOPPED;

    current_pos_ch.value = HOMEKIT_UINT8(100);
    target_pos_ch.value  = HOMEKIT_UINT8(100);
    s_cal_state          = CAL_IDLE;

    nvs_save_calibration(elapsed);
    nvs_save_last_position(100);
    homekit_notify_position();

    ESP_LOGI(TAG_CAL, "Calibration complete: travel time = %lu ms",
             (unsigned long)elapsed);
}

static void calibration_task(void *arg) {
    ESP_LOGI(TAG_CAL, "=== CALIBRATION START ===");

    s_cal_success = false;
    s_motion      = MOTION_STOPPED;
    relays_all_off();
    vTaskDelay(pdMS_TO_TICKS(300));

    // ── Phase 1: drive to closed end-stop ─────────────────────────────────────
    ESP_LOGI(TAG_CAL, "Phase 1: closing fully (LED: fast blink)...");
    s_cal_state = CAL_CLOSING;

    uint32_t close_ms = (uint32_t)(s_cal_ms * ENDSTOP_BUFFER_FACTOR);
    if (close_ms < 8000) {
        close_ms = 8000;
    }

    relay_activate_close();
    vTaskDelay(pdMS_TO_TICKS(close_ms));
    relays_all_off();

    s_cur_pos            = 0;
    s_tgt_pos            = 0;
    s_motion             = MOTION_STOPPED;
    current_pos_ch.value = HOMEKIT_UINT8(0);
    target_pos_ch.value  = HOMEKIT_UINT8(0);
    homekit_notify_position();

    vTaskDelay(pdMS_TO_TICKS(500));

    // ── Phase 2: open and wait for user to press STOP ─────────────────────────
    ESP_LOGI(TAG_CAL, "Phase 2: opening (LED: slow blink) - press STOP when fully open");

    s_cal_t0_ms          = now_ms();
    s_cal_state          = CAL_OPENING;
    s_motion             = MOTION_OPENING;
    target_pos_ch.value  = HOMEKIT_UINT8(100);
    relay_activate_open();
    homekit_notify_position();

    uint32_t t_start        = now_ms();
    uint32_t last_notify_ms = t_start;
    uint32_t last_log_ms    = t_start;
    uint32_t ref_ms         = (s_cal_ms > 0) ? s_cal_ms : DEFAULT_TRAVEL_MS;
    int      last_notified  = 0;

    while (s_cal_state == CAL_OPENING) {
        uint32_t now = now_ms();

        if ((now - t_start) > CAL_OPEN_MAX_MS) {
            ESP_LOGW(TAG_CAL, "Timeout: calibration aborted after %lu s",
                     (unsigned long)(CAL_OPEN_MAX_MS / 1000));
            relays_all_off();
            s_cal_success = false;
            s_cal_state   = CAL_IDLE;
            s_cur_pos     = 0;
            s_tgt_pos     = 0;
            s_motion      = MOTION_STOPPED;
            homekit_notify_position();
            break;
        }

        // Live position estimate: only notify HomeKit when integer value changes.
        if ((now - last_notify_ms) >= POS_UPDATE_INTERVAL_MS) {
            uint32_t elapsed = now - s_cal_t0_ms;
            int estimated    = (int)((float)elapsed / (float)ref_ms * 100.0f);
            if (estimated > 99) estimated = 99;
            s_cur_pos = estimated;
            if (estimated != last_notified) {
                last_notified = estimated;
                homekit_notify_position();
            }
            last_notify_ms = now;
        }

        // Serial progress log every second for installer/monitor feedback.
        if ((now - last_log_ms) >= 1000) {
            uint32_t elapsed = now - s_cal_t0_ms;
            int pct = (int)((float)elapsed / (float)ref_ms * 100.0f);
            if (pct > 99) pct = 99;
            ESP_LOGI(TAG_CAL, "Opening... ~%d%% (%lu s) - press STOP when fully open",
                     pct, (unsigned long)(elapsed / 1000));
            last_log_ms = now;
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }

    ESP_LOGI(TAG_CAL, "=== CALIBRATION END (state: %s) ===",
             s_cal_success ? "SUCCESS" : "ABORTED");

    vTaskDelete(NULL);
}

static void calibration_start(void) {
    if (s_cal_state != CAL_IDLE) {
        return;
    }

    if (s_is_homing) {
        ESP_LOGW(TAG_CAL, "Cannot calibrate while homing");
        return;
    }

    if (xTaskCreate(calibration_task, "cal_task", 4096, NULL, 4, NULL) != pdPASS) {
        ESP_LOGE(TAG_CAL, "Failed to create calibration task");
        return;
    }
    if (xTaskCreate(calibration_led_task, "cal_led", 1024, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG_CAL, "Failed to create calibration LED task");
    }
}

// ── Boot homing ───────────────────────────────────────────────────────────────
static void homing_task(void *arg) {
    uint8_t last_pos = (uint8_t)(uintptr_t)arg;

    ESP_LOGI(TAG, "Homing: closing fully to establish position 0%%...");

    s_is_homing = true;
    s_motion    = MOTION_CLOSING;

    uint32_t close_ms = (uint32_t)(s_cal_ms * ENDSTOP_BUFFER_FACTOR);
    if (close_ms < 8000) {
        close_ms = 8000;
    }

