AchimPieters/esp32-homekit-Sunshade/main/main.c
    relay_activate_close();
    vTaskDelay(pdMS_TO_TICKS(close_ms));
    relays_all_off();

    s_cur_pos = 0;
    s_tgt_pos = 0;
    s_motion  = MOTION_STOPPED;

    current_pos_ch.value = HOMEKIT_UINT8(0);
    target_pos_ch.value  = HOMEKIT_UINT8(0);
    homekit_notify_position();

    ESP_LOGI(TAG, "Homing: position 0%% established");

    vTaskDelay(pdMS_TO_TICKS(500));

    s_is_homing = false;

    if (last_pos > 0 && last_pos <= 100) {
        ESP_LOGI(TAG, "Homing: restoring to last target %d%%", last_pos);
        sunshade_move_to((int)last_pos);
    } else {
        ESP_LOGI(TAG, "Homing complete; sunshade at 0%%");
    }

    vTaskDelete(NULL);
}

// ── Identify ──────────────────────────────────────────────────────────────────
static volatile TaskHandle_t s_identify_task = NULL;

static void accessory_identify_task(void *args) {
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 2; j++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(100));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        vTaskDelay(pdMS_TO_TICKS(250));
    }

    led_write(false);
    s_identify_task = NULL;
    vTaskDelete(NULL);
}

static void accessory_identify(homekit_value_t _value) {
    ESP_LOGI("INFORMATION", "Accessory identify");
    if (s_identify_task != NULL) {
        return;
    }
    xTaskCreate(accessory_identify_task, "identify",
                1024, NULL, 2, (TaskHandle_t *)&s_identify_task);
}

// ── HomeKit accessory definition ──────────────────────────────────────────────
#define DEVICE_NAME         "HomeKit Sunshade"
#define DEVICE_MANUFACTURER "StudioPieters\xc2\xae"
#define DEVICE_SERIAL       "NLDA4SQN1466"
#define DEVICE_MODEL        "SD466NL/A"

static homekit_characteristic_t name =
    HOMEKIT_CHARACTERISTIC_(NAME, DEVICE_NAME);
static homekit_characteristic_t manufacturer =
    HOMEKIT_CHARACTERISTIC_(MANUFACTURER, DEVICE_MANUFACTURER);
static homekit_characteristic_t serial =
    HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, DEVICE_SERIAL);
static homekit_characteristic_t model =
    HOMEKIT_CHARACTERISTIC_(MODEL, DEVICE_MODEL);
static homekit_characteristic_t revision =
    HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
static homekit_characteristic_t ota_trigger = API_OTA_TRIGGER;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
    HOMEKIT_ACCESSORY(.id = 1,
                      .category = homekit_accessory_category_window_covering,
                      .services = (homekit_service_t*[]) {
        HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t*[]) {
            &name,
            &manufacturer,
            &serial,
            &model,
            &revision,
            HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
            NULL
        }),
        HOMEKIT_SERVICE(WINDOW_COVERING, .primary = true, .characteristics = (homekit_characteristic_t*[]) {
            HOMEKIT_CHARACTERISTIC(NAME, "Sun Screen"),
            &current_pos_ch,
            &target_pos_ch,
            &pos_state_ch,
            &hold_pos_ch,
            &ota_trigger,
            NULL
        }),
#ifdef CONFIG_TEMP_SENSOR_ENABLE
        HOMEKIT_SERVICE(TEMPERATURE_SENSOR, .characteristics = (homekit_characteristic_t*[]) {
            HOMEKIT_CHARACTERISTIC(NAME, "Temperature"),
            &cur_temp_ch,
            NULL
        }),
        HOMEKIT_SERVICE(HUMIDITY_SENSOR, .characteristics = (homekit_characteristic_t*[]) {
            HOMEKIT_CHARACTERISTIC(NAME, "Humidity"),
            &cur_humid_ch,
            NULL
        }),
#endif
#ifdef CONFIG_LUX_SENSOR_ENABLE
        HOMEKIT_SERVICE(LIGHT_SENSOR, .characteristics = (homekit_characteristic_t*[]) {
            HOMEKIT_CHARACTERISTIC(NAME, "Ambient Light"),
            &cur_lux_ch,
            NULL
        }),
#endif
        NULL
    }),
    NULL
};
#pragma GCC diagnostic pop

static homekit_server_config_t hk_config = {
    .accessories = accessories,
    .password    = CONFIG_ESP_SETUP_CODE,
    .setupId     = CONFIG_ESP_SETUP_ID,
};

// ── TTP223 digital touch inputs ───────────────────────────────────────────────
typedef struct {
    gpio_num_t gpio;
    bool stable;
    bool last_raw;
    uint32_t changed_at_ms;
} debounced_input_t;

static bool ttp_read_raw(gpio_num_t gpio) {
    return gpio_get_level(gpio) == TTP_ACTIVE_LEVEL;
}

static bool debounce_update(debounced_input_t *input) {
    bool raw     = ttp_read_raw(input->gpio);
    uint32_t now = now_ms();

    if (raw != input->last_raw) {
        input->last_raw      = raw;
        input->changed_at_ms = now;
    }

    if ((now - input->changed_at_ms) >= TTP_DEBOUNCE_MS) {
        input->stable = raw;
    }

    return input->stable;
}

static void ttp_gpio_init_one(gpio_num_t gpio) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << gpio),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };

    ESP_ERROR_CHECK(gpio_config(&io_conf));
}

static void ttp_init(void) {
    ttp_gpio_init_one((gpio_num_t)TTP_UP_GPIO);
    ttp_gpio_init_one((gpio_num_t)TTP_STOP_GPIO);
    ttp_gpio_init_one((gpio_num_t)TTP_DOWN_GPIO);

    ESP_LOGI(TAG_TOUCH,
             "TTP223 inputs: UP=GPIO%d STOP=GPIO%d DOWN=GPIO%d active_level=%d debounce=%dms poll=%dms",
             TTP_UP_GPIO, TTP_STOP_GPIO, TTP_DOWN_GPIO,
             TTP_ACTIVE_LEVEL, TTP_DEBOUNCE_MS, TTP_POLL_MS);
}

static void ttp_task(void *arg) {
    // Seed from actual GPIO state: a sensor already active at boot must not
    // trigger a false rising edge on the first poll.
    uint32_t t0       = now_ms();
    bool init_up      = ttp_read_raw((gpio_num_t)TTP_UP_GPIO);
    bool init_stop    = ttp_read_raw((gpio_num_t)TTP_STOP_GPIO);
    bool init_down    = ttp_read_raw((gpio_num_t)TTP_DOWN_GPIO);

    debounced_input_t up = {
        .gpio          = (gpio_num_t)TTP_UP_GPIO,
        .stable        = init_up,
        .last_raw      = init_up,
        .changed_at_ms = t0,
    };

    debounced_input_t stop_in = {
        .gpio          = (gpio_num_t)TTP_STOP_GPIO,
        .stable        = init_stop,
        .last_raw      = init_stop,
        .changed_at_ms = t0,
    };

    debounced_input_t down = {
        .gpio          = (gpio_num_t)TTP_DOWN_GPIO,
        .stable        = init_down,
        .last_raw      = init_down,
        .changed_at_ms = t0,
    };

    bool up_prev   = init_up;
    bool stop_prev = init_stop;
    bool down_prev = init_down;

    // Wall-clock timestamp for hold detection avoids poll-jitter accumulation error.
    uint32_t stop_press_start = 0;
    bool     cal_armed        = false;

