AchimPieters/esp32-homekit-Sunshade/main/main.c
    for (;;) {
        bool up_now   = debounce_update(&up);
        bool stop_now = debounce_update(&stop_in);
        bool down_now = debounce_update(&down);

        if (up_now && !up_prev) {
            ESP_LOGI(TAG_TOUCH, "UP touched -> opening");
            sunshade_open();
        }

        if (down_now && !down_prev) {
            ESP_LOGI(TAG_TOUCH, "DOWN touched -> closing");
            sunshade_close();
        }

        if (stop_now) {
            if (!stop_prev) {
                stop_press_start = now_ms();
            }

            if (!cal_armed && (now_ms() - stop_press_start) >= CAL_HOLD_TRIGGER_MS) {
                ESP_LOGI(TAG_TOUCH, "STOP held %lu ms -> calibration trigger",
                         (unsigned long)(now_ms() - stop_press_start));
                cal_armed = true;
                calibration_start();
            }
        } else {
            if (stop_prev && !cal_armed) {
                if (s_cal_state == CAL_OPENING) {
                    ESP_LOGI(TAG_TOUCH, "STOP -> confirm fully open");
                    calibration_confirm_open();
                } else {
                    ESP_LOGI(TAG_TOUCH, "STOP touched -> stopping");
                    sunshade_stop();
                }
            }

            cal_armed = false;
        }

        up_prev   = up_now;
        stop_prev = stop_now;
        down_prev = down_now;

        vTaskDelay(pdMS_TO_TICKS(TTP_POLL_MS));
    }
}

// ── Physical button ───────────────────────────────────────────────────────────
static void button_callback(button_event_t event, void *context) {
    switch (event) {
    case button_event_single_press:
        ESP_LOGI(TAG_BUTTON, "Single press -> update/reboot");
        relays_all_off();
        lifecycle_request_update_and_reboot();
        break;

    case button_event_double_press:
        ESP_LOGI(TAG_BUTTON, "Double press -> HomeKit reset + restart");
        relays_all_off();
        homekit_server_reset();
        esp_restart();
        break;

    case button_event_long_press:
        ESP_LOGI(TAG_BUTTON, "Long press -> factory reset + reboot");
        relays_all_off();
        lifecycle_factory_reset_and_reboot();
        break;

    default:
        ESP_LOGI(TAG_BUTTON, "Unknown button event: %d", event);
        break;
    }
}

// ── GPIO init ─────────────────────────────────────────────────────────────────
static void gpio_init_all(void) {
    gpio_reset_pin(LED_GPIO);
    gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
    led_write(false);

    gpio_reset_pin(RELAY_OPEN_GPIO);
    gpio_set_direction(RELAY_OPEN_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(RELAY_OPEN_GPIO, relay_output_level(RELAY_ACTIVE_LEVEL, false));

    gpio_reset_pin(RELAY_CLOSE_GPIO);
    gpio_set_direction(RELAY_CLOSE_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(RELAY_CLOSE_GPIO, relay_output_level(RELAY_ACTIVE_LEVEL, false));
    s_relay_dir = MOTION_STOPPED;

    ESP_LOGI(TAG, "GPIO: LED=%d RELAY_OPEN=%d RELAY_CLOSE=%d active_level=%d reverse_delay=%dms",
             LED_GPIO, RELAY_OPEN_GPIO, RELAY_CLOSE_GPIO,
             RELAY_ACTIVE_LEVEL, RELAY_REVERSE_DELAY_MS);
}

// ── WiFi ready ────────────────────────────────────────────────────────────────
static void on_wifi_ready(void) {
    static volatile bool homekit_started = false;

    if (homekit_started) {
        ESP_LOGI("INFORMATION", "HomeKit already running; skipping re-init");
        return;
    }

    ESP_LOGI("INFORMATION", "Starting HomeKit server...");
    homekit_server_init(&hk_config);
    homekit_started = true;
}

// ── Wind speed sensor ─────────────────────────────────────────────────────────
#ifdef CONFIG_WIND_SENSOR_ENABLE
/*
 * HWFS-1 anemometer — implementation notes (based on field research):
 *
 * POWER:     Passive / self-generating. NO external VCC required.
 *            The rotating cups drive a small DC generator in the base.
 *            Wiring: signal wire (black+stripe) and ground wire (solid black) only.
 *
 * OUTPUT:    0–3.3 V DC analog (HWFS-1 3.3 V version). Max output = 14 m/s.
 *            Although 3.3 V matches ESP32 Vcc, the ADC_ATTEN_DB_11 accurate range
 *            is only 150–2450 mV. Use R1=10 kΩ + R2=22 kΩ to bring 3.3 V down
 *            to 2.27 V, safely within the accurate range.
 *
 * FORMULA:   3.3 V = 14 m/s (manufacturer stated, linear).
 *            The HWFS-1 uses a DC generator; output is nonlinear at very low RPM
 *            (cogging torque, brush friction). Calibrate against a reference meter
 *            and adjust WIND_SENSOR_MAX_SPEED_DS if readings are off.
 *            Default Kconfig WIND_SENSOR_MAX_SPEED_DS = 140 (14.0 m/s).
 *
 * NOISE:     DC commutator generates ripple voltage. Cogging creates step-wise
 *            output near startup threshold. Hardware: place 10 kΩ + 10 µF RC
 *            low-pass filter (τ ≈ 100 ms) on the signal before the ESP32 ADC.
 *            Software: 16-sample average per reading (implemented below).
 *
 * ADC:       ESP32 internal ADC has ±10% nonlinearity without calibration.
 *            ADC_ATTEN_DB_11 useful range: 150 mV–2450 mV. Above this the
 *            reading saturates nonlinearly. Stay within range with the divider.
 *            ESP32 ADC reads unreliably below ~100 mV; the 30 mV resting offset
 *            is masked by the WIND_ADC_ZERO_OFFSET_MV threshold below.
 */

// Number of ADC samples averaged per reading to reduce commutator ripple.
#define WIND_ADC_SAMPLES  16

// ADC_ATTEN_DB_11 full-scale approximation (mV). Actual varies ±5% per chip.
#define WIND_ADC_ATTEN_FS_MV  2450

// Sensor resting offset at the ADC pin with R1=10k/R2=22k divider:
// ~33 mV sensor × 22/32 = ~23 mV. Use 30 mV threshold for safety margin.
#define WIND_ADC_ZERO_OFFSET_MV  30

static void wind_task(void *arg) {
    adc_unit_t    adc_unit;
    adc_channel_t adc_channel;

    if (adc_oneshot_io_to_channel(WIND_ADC_GPIO, &adc_unit, &adc_channel) != ESP_OK) {
        ESP_LOGE(TAG_WIND, "GPIO%d is not a valid ADC pin; wind task disabled", WIND_ADC_GPIO);
        vTaskDelete(NULL);
        return;
    }

    // ADC2 conflicts with WiFi on ESP32; only ADC1 (GPIO32-39) is safe.
    if (adc_unit != ADC_UNIT_1) {
        ESP_LOGE(TAG_WIND, "GPIO%d maps to ADC2 (conflicts with WiFi); use GPIO32-39",
                 WIND_ADC_GPIO);
        vTaskDelete(NULL);
        return;
    }

    adc_oneshot_unit_handle_t adc_handle;
    adc_oneshot_unit_init_cfg_t unit_cfg = {
        .unit_id  = ADC_UNIT_1,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&unit_cfg, &adc_handle));

    // ADC_ATTEN_DB_11: accurate range 150–2450 mV. Use R1=10k/R2=22k divider
    // so 3.3 V sensor max maps to 2270 mV, safely within the accurate range.
    adc_oneshot_chan_cfg_t chan_cfg = {
        .atten    = ADC_ATTEN_DB_11,
        .bitwidth = ADC_BITWIDTH_12,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc_handle, adc_channel, &chan_cfg));

    ESP_LOGI(TAG_WIND,
             "HWFS-1 ready: GPIO%d | cal factor V×%d.%d m/s | "
             "close >= %d.%d m/s | reopen < %d.%d m/s | poll %lu ms | %d samples/reading",
             WIND_ADC_GPIO,
             (WIND_MAX_SPEED_DS * 1000 / WIND_ADC_FULL_SCALE_MV) / 10,
             (WIND_MAX_SPEED_DS * 1000 / WIND_ADC_FULL_SCALE_MV) % 10,
             WIND_CLOSE_THRESHOLD_DS / 10,  WIND_CLOSE_THRESHOLD_DS % 10,
             WIND_REOPEN_THRESHOLD_DS / 10, WIND_REOPEN_THRESHOLD_DS % 10,
             (unsigned long)WIND_POLL_MS,
             WIND_ADC_SAMPLES);

