AchimPieters/esp32-homekit-Sunshade/main/main.c
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(WIND_POLL_MS));

        // Average WIND_ADC_SAMPLES readings to suppress commutator ripple and
        // brush-contact noise. Spread samples evenly within the poll interval.
        int32_t raw_sum = 0;
        int     valid   = 0;
        for (int s = 0; s < WIND_ADC_SAMPLES; s++) {
            int raw = 0;
            if (adc_oneshot_read(adc_handle, adc_channel, &raw) == ESP_OK) {
                raw_sum += raw;
                valid++;
            }
            vTaskDelay(pdMS_TO_TICKS(5));
        }

        if (valid == 0) {
            ESP_LOGW(TAG_WIND, "All ADC reads failed");
            continue;
        }

        int raw_avg = (int)(raw_sum / valid);

        // Convert averaged raw counts to mV using the ADC_ATTEN_DB_11 full-scale.
        int mv = (int)((float)raw_avg * (float)WIND_ADC_ATTEN_FS_MV / 4095.0f);

        // Mask the resting offset (~33 mV sensor → ~20 mV at ADC after divider).
        // Also masks the ESP32 ADC's unreliable sub-100 mV region.
        if (mv <= WIND_ADC_ZERO_OFFSET_MV) {
            mv = 0;
        }

        // Linear conversion: speed_ds = mv × MAX_SPEED_DS / ADC_FULL_SCALE_MV
        // This implements: speed(m/s) = V_sensor × calibration_factor
        // where calibration_factor is derived from MAX_SPEED_DS and the divider ratio.
        int speed_ds = wind_speed_ds(mv, WIND_ADC_FULL_SCALE_MV, WIND_MAX_SPEED_DS);

        // Log at INFO level so installers can read raw mV for field calibration.
        ESP_LOGI(TAG_WIND, "%d.%d m/s (avg_raw=%d, %d mV)",
                 speed_ds / 10, speed_ds % 10, raw_avg, mv);

        sensor_action_t act = sensor_hysteresis(s_wind_closed, speed_ds,
                                                WIND_CLOSE_THRESHOLD_DS,
                                                WIND_REOPEN_THRESHOLD_DS);
        if (act == SENSOR_TRIGGER_CLOSE) {
            ESP_LOGW(TAG_WIND, "Wind %d.%d m/s >= %d.%d m/s: closing for protection",
                     speed_ds / 10, speed_ds % 10,
                     WIND_CLOSE_THRESHOLD_DS / 10, WIND_CLOSE_THRESHOLD_DS % 10);
            s_wind_saved_pos = s_tgt_pos;
            s_wind_closed    = true;
            sunshade_close();
        } else if (act == SENSOR_TRIGGER_REOPEN) {
            ESP_LOGI(TAG_WIND, "Wind %d.%d m/s < %d.%d m/s: restoring to %d%%",
                     speed_ds / 10, speed_ds % 10,
                     WIND_REOPEN_THRESHOLD_DS / 10, WIND_REOPEN_THRESHOLD_DS % 10,
                     s_wind_saved_pos);
            s_wind_closed = false;
            sunshade_move_to(s_wind_saved_pos);
        }
    }
}
#endif

// ── Rain sensor ───────────────────────────────────────────────────────────────
#ifdef CONFIG_RAIN_SENSOR_ENABLE
/*
 * MH-RD rain sensor — implementation notes:
 *
 * POWER:   VCC = 3.3 V, GND = GND. The module has an onboard LM393 comparator.
 *          Sensitivity is set via the onboard potentiometer.
 *
 * OUTPUT:  DO = digital output. Active-low by default (DO goes LOW when rain
 *          is detected). Configure RAIN_SENSOR_ACTIVE_LEVEL = 0 (default).
 *          AO (analog output) is not used.
 *
 * NOISE:   The sensing pad corrodes outdoors over time. Mount the pad under a
 *          sheltered overhang to limit exposure. The 2 s debounce prevents
 *          false triggers from brief condensation or dust.
 */
static void rain_task(void *arg) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << RAIN_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = (RAIN_ACTIVE_LEVEL == 0) ? GPIO_PULLUP_ENABLE  : GPIO_PULLUP_DISABLE,
        .pull_down_en = (RAIN_ACTIVE_LEVEL == 1) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    ESP_LOGI(TAG_RAIN,
             "MH-RD ready: GPIO%d active_%s poll=%lums debounce=%lums",
             RAIN_GPIO,
             RAIN_ACTIVE_LEVEL ? "high" : "low",
             (unsigned long)RAIN_POLL_MS,
             (unsigned long)RAIN_DEBOUNCE_MS);

    bool     last_raw   = (gpio_get_level(RAIN_GPIO) == RAIN_ACTIVE_LEVEL);
    uint32_t changed_at = now_ms();
    bool     stable     = last_raw;

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(RAIN_POLL_MS));

        bool     raw  = (gpio_get_level(RAIN_GPIO) == RAIN_ACTIVE_LEVEL);
        uint32_t now  = now_ms();

        if (raw != last_raw) {
            last_raw   = raw;
            changed_at = now;
        }

        if ((now - changed_at) >= RAIN_DEBOUNCE_MS) {
            bool new_stable = raw;

            if (new_stable && !stable) {
                ESP_LOGW(TAG_RAIN, "Rain detected: closing for protection (saved pos=%d%%)",
                         s_tgt_pos);
                s_rain_saved_pos = s_tgt_pos;
                s_rain_closed    = true;
                sunshade_close();
            } else if (!new_stable && stable) {
                ESP_LOGI(TAG_RAIN, "Rain stopped: restoring to %d%%", s_rain_saved_pos);
                s_rain_closed = false;
                sunshade_move_to(s_rain_saved_pos);
            }

            stable = new_stable;
        }
    }
}
#endif

// ── Shared I2C bus ────────────────────────────────────────────────────────────
// The BH1750 light sensor and the SHT3x climate sensor share one I2C bus. It is
// created once from app_main before the sensor tasks start, so there is no race
// and no double initialisation.
#ifdef SUNSHADE_USE_I2C
static i2c_master_bus_handle_t s_i2c_bus = NULL;

static esp_err_t i2c_bus_init(void) {
    i2c_master_bus_config_t bus_cfg = {
        .clk_source                   = I2C_CLK_SRC_DEFAULT,
        .i2c_port                     = I2C_NUM_0,
        .scl_io_num                   = I2C_SCL_GPIO,
        .sda_io_num                   = I2C_SDA_GPIO,
        .glitch_ignore_cnt            = 7,
        .flags.enable_internal_pullup = true,
    };

    esp_err_t err = i2c_new_master_bus(&bus_cfg, &s_i2c_bus);
    if (err != ESP_OK) {
        ESP_LOGE(TAG_I2C, "I2C bus init failed (SDA=%d SCL=%d): %s",
                 I2C_SDA_GPIO, I2C_SCL_GPIO, esp_err_to_name(err));
    } else {
        ESP_LOGI(TAG_I2C, "I2C bus ready (SDA=%d SCL=%d)", I2C_SDA_GPIO, I2C_SCL_GPIO);
    }
    return err;
}
#endif

// ── Ambient light sensor ──────────────────────────────────────────────────────
#ifdef CONFIG_LUX_SENSOR_ENABLE
/*
 * BH1750 (GY-302) ambient light sensor — implementation notes:
 *
 * BUS:     I2C. VCC = 3.3 V, GND = GND, SDA/SCL on the configured GPIOs.
 *          GY-302 breakouts carry onboard pull-ups; internal pull-ups are also
 *          enabled here as a safety net for bare modules.
 *
 * ADDRESS: 0x23 when ADDR is tied LOW (default), 0x5C when ADDR is tied HIGH.
 *
 * MODE:    Continuous high-resolution mode (1 lux resolution, ~120 ms/sample).
 *          Reading returns a big-endian 16-bit count; lux = count / 1.2.
 *
 * USE:     Bright sun closes the sunshade for shade; once the light drops below
 *          the reopen threshold the previous position is restored. The same
 *          high-value hysteresis as the wind protection is used.
 */
#define BH1750_CMD_POWER_ON      0x01
#define BH1750_CMD_CONT_HRES     0x10

static void lux_task(void *arg) {
    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address  = LUX_I2C_ADDR,
        .scl_speed_hz    = 100000,
    };

