AchimPieters/esp32-homekit-Sunshade/main/main.c
    i2c_master_dev_handle_t dev = NULL;
    if (i2c_master_bus_add_device(s_i2c_bus, &dev_cfg, &dev) != ESP_OK) {
        ESP_LOGE(TAG_LUX, "BH1750 not added at 0x%02X; lux task disabled", LUX_I2C_ADDR);
        vTaskDelete(NULL);
        return;
    }

    uint8_t cmd = BH1750_CMD_POWER_ON;
    bool ok = (i2c_master_transmit(dev, &cmd, 1, 1000) == ESP_OK);
    cmd = BH1750_CMD_CONT_HRES;
    ok = ok && (i2c_master_transmit(dev, &cmd, 1, 1000) == ESP_OK);
    if (!ok) {
        ESP_LOGE(TAG_LUX, "BH1750 not responding at 0x%02X; check wiring/address",
                 LUX_I2C_ADDR);
        i2c_master_bus_rm_device(dev);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG_LUX,
             "BH1750 ready: addr 0x%02X | close >= %d lux | reopen < %d lux | poll %d ms",
             LUX_I2C_ADDR, LUX_CLOSE_LUX, LUX_REOPEN_LUX, LUX_POLL_MS);

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(LUX_POLL_MS));

        uint8_t raw[2] = {0};
        if (i2c_master_receive(dev, raw, sizeof(raw), 1000) != ESP_OK) {
            ESP_LOGW(TAG_LUX, "BH1750 read failed");
            continue;
        }

        uint16_t count = (uint16_t)((raw[0] << 8) | raw[1]);
        int lux = bh1750_raw_to_lux(count);

        ESP_LOGI(TAG_LUX, "%d lux (raw=%u)", lux, count);

        // Publish to HomeKit (clamped to the HAP valid range 0.0001–100000 lux).
        float hk_lux = (lux < 1) ? 0.0001f : (float)lux;
        cur_lux_ch.value = HOMEKIT_FLOAT(hk_lux);
        homekit_characteristic_notify(&cur_lux_ch, cur_lux_ch.value);

        sensor_action_t act = sensor_hysteresis(s_lux_closed, lux,
                                                LUX_CLOSE_LUX, LUX_REOPEN_LUX);
        if (act == SENSOR_TRIGGER_CLOSE) {
            ESP_LOGW(TAG_LUX, "Light %d lux >= %d lux: closing for sun protection",
                     lux, LUX_CLOSE_LUX);
            s_lux_saved_pos = s_tgt_pos;
            s_lux_closed    = true;
            sunshade_close();
        } else if (act == SENSOR_TRIGGER_REOPEN) {
            ESP_LOGI(TAG_LUX, "Light %d lux < %d lux: restoring to %d%%",
                     lux, LUX_REOPEN_LUX, s_lux_saved_pos);
            s_lux_closed = false;
            sunshade_move_to(s_lux_saved_pos);
        }
    }
}
#endif

// ── Temperature & humidity sensor ─────────────────────────────────────────────
#ifdef CONFIG_TEMP_SENSOR_ENABLE
/*
 * Sensirion SHT3x (SHT30/31/35) — implementation notes:
 *
 * BUS:     Shared I2C bus. VCC = 3.3 V, GND = GND.
 * ADDRESS: 0x44 when ADDR is tied LOW (default), 0x45 when tied HIGH.
 * READ:    Single-shot, high repeatability, clock stretching disabled (0x2400).
 *          Wait ~20 ms, then read 6 bytes: temp[MSB,LSB,CRC], hum[MSB,LSB,CRC].
 *          Each 16-bit word is CRC-8 protected (poly 0x31, init 0xFF).
 *
 * USE:     Display only — published as HomeKit Temperature and Humidity sensors.
 *          The readings never move the sunshade.
 */
#define SHT3X_CMD_MEAS_HIGH_MSB  0x24
#define SHT3X_CMD_MEAS_HIGH_LSB  0x00

static void temp_task(void *arg) {
    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address  = TEMP_I2C_ADDR,
        .scl_speed_hz    = 100000,
    };

    i2c_master_dev_handle_t dev = NULL;
    if (i2c_master_bus_add_device(s_i2c_bus, &dev_cfg, &dev) != ESP_OK) {
        ESP_LOGE(TAG_TEMP, "SHT3x not added at 0x%02X; temp task disabled", TEMP_I2C_ADDR);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG_TEMP, "SHT3x ready: addr 0x%02X | poll %d ms", TEMP_I2C_ADDR, TEMP_POLL_MS);

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(TEMP_POLL_MS));

        uint8_t cmd[2] = { SHT3X_CMD_MEAS_HIGH_MSB, SHT3X_CMD_MEAS_HIGH_LSB };
        if (i2c_master_transmit(dev, cmd, sizeof(cmd), 1000) != ESP_OK) {
            ESP_LOGW(TAG_TEMP, "SHT3x measure command failed");
            continue;
        }

        // High-repeatability conversion takes up to 15 ms; allow margin.
        vTaskDelay(pdMS_TO_TICKS(20));

        uint8_t raw[6] = {0};
        if (i2c_master_receive(dev, raw, sizeof(raw), 1000) != ESP_OK) {
            ESP_LOGW(TAG_TEMP, "SHT3x read failed");
            continue;
        }

        if (sensirion_crc8(raw[0], raw[1]) != raw[2] ||
            sensirion_crc8(raw[3], raw[4]) != raw[5]) {
            ESP_LOGW(TAG_TEMP, "SHT3x CRC mismatch; discarding sample");
            continue;
        }

        uint16_t t_raw = (uint16_t)((raw[0] << 8) | raw[1]);
        uint16_t h_raw = (uint16_t)((raw[3] << 8) | raw[4]);

        float temp_c   = sht3x_raw_to_celsius(t_raw);
        float humid_pct = sht3x_raw_to_humidity(h_raw);

        // Integer-formatted log (avoids %f, which newlib nano-format omits).
        int t_tenths = (int)(temp_c * 10.0f);
        int h_tenths = (int)(humid_pct * 10.0f);
        ESP_LOGI(TAG_TEMP, "%d.%d C, %d.%d %%RH",
                 t_tenths / 10, (t_tenths < 0 ? -t_tenths : t_tenths) % 10,
                 h_tenths / 10, h_tenths % 10);

        cur_temp_ch.value  = HOMEKIT_FLOAT(temp_c);
        cur_humid_ch.value = HOMEKIT_FLOAT(humid_pct);
        homekit_characteristic_notify(&cur_temp_ch, cur_temp_ch.value);
        homekit_characteristic_notify(&cur_humid_ch, cur_humid_ch.value);
    }
}
#endif

// ── Entry point ───────────────────────────────────────────────────────────────
void app_main(void) {
    ESP_ERROR_CHECK(lifecycle_nvs_init());
    lifecycle_log_post_reset_state("INFORMATION");
    ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFORMATION"));

    gpio_init_all();

    nvs_load_calibration();

    ttp_init();

    if (xTaskCreate(ttp_task, "ttp_task", 4096, NULL, 5, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create TTP task");
    }

    // Physical lifecycle button.
    // Wiring: GND -> button -> GPIO25.
    // Active-low requires a pull-up. Configure it explicitly so the input
    // cannot float if the button library does not enable the pull-up itself.
    gpio_config_t btn_io = {
        .pin_bit_mask = (1ULL << BUTTON_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&btn_io));

